/*
**                        Copyright 2001-2003 by KVASER AB
**                    P.O Box 4076 SE-51104 KINNAHULT, SWEDEN
**
**                     Copyright 2004-2014 by TK Engineering Oy
**                       P.O. Box 810, FI-65101 Vaasa, FINLAND
**                     E-mail: info@tke.fi, Web: http://www.tke.fi
**
** This software is furnished under a license and may be used and copied
** only in accordance with the terms of such license.
**
**
**  CANopen protocol handling rutines
*/

#pragma GCC diagnostic ignored "-Wtype-limits"
#pragma GCC diagnostic ignored "-Wpointer-sign"
#pragma GCC diagnostic ignored "-Wsign-compare"
#pragma GCC diagnostic ignored "-Wunused-function"
#pragma GCC diagnostic ignored "-Wunused-variable"
#ifndef __clang__
#pragma GCC diagnostic ignored "-Wunused-but-set-variable"
#endif
#ifdef __clang__
#pragma GCC diagnostic ignored "-Wparentheses-equality"
#endif

#include "bios/bios.h"
#include "bios/printd.h"

#include <stdlib.h>
#include <string.h> //for memset
#include "canopen.h"
#include "canopenM.h" /* For initating the CANopen master (nodeInfo) array... */
#include "coConfig.h"

#if TIME_H_IS_AVAILABLE
  #include <time.h>
#endif

/* This struct stores all communication objects 0x1000 to 0x1FFF */
typedef struct  {
  uint8 magicNumber; /* Used to verify integrity of data when storing to nvram - Is always set to 0x0D on store and 0xEE on restore */
  uint32 deviceType; /* 0x1000 - Device Type. Defines the Device Profile or Application Profile */
#if EMERGENCY_PRODUCER_HISTORY
  /* Implementation of objIdx 0x1003, p.9-65, DS301. */
  coEmcyProdHistEntr  emcyProdHistList[MAX_EMCY_PRODUCER_HISTORY_RECORDED];
#endif
  uint8 errorRegister; /* 0x1001 - Error Register. */
  uint32 syncCOBID; /* 0x1005 - COB-ID SYNC message. Defines the COB ID of SYNC messages and if this device generates SYNC messages */
  uint32 syncPeriod; /* 0x1006 - Communication Cycle Period. The period in microsecond of SYNC messages */
#if SYNC_WINDOW_LENGTH
  uint32 syncWindowLen; /* 0x1007 - Synchronous Window Length (in microseconds) */
#endif
  /* 0x1008-0x100A is read from the application */
  uint16 guardTime; /* 0x100C - Guard time (in milliseconds). Multiplied with life time factor this gives us the lifetime of the lifeguarding protocol. */
  uint8 lifeTimeFactor; /* 0x100D - Life time factor. Multiplied with guard time this gives us the lifetime of the lifeguarding protocol. */
  /*  uint32 timeStampCOBID;*/ /* 0x1012 - COB-ID time stamp object. Defines COB-ID for timestamps and if device generates or consumes time */
  uint32 emcyCOBID; /* 0x1014 - COB-ID EMCY. The COB-ID used when seding EMCY messages */ 
//  uint16 emcyInhibitTime; /* 0x1015 - Inhibit time EMCY (in units of 100microseconds) */
#if HEARTBEAT_CONSUMER
  HeartbeatNodeInfo heartbeatNodes[MAX_HEARTBEAT_NODES]; /* 0x1016 - Consumer Heartbeat Time. Heartbeat Consumer monitored nodes list */
#endif
  uint16 producerHeartBeatTime; /* 0x1017 - Producer Heartbeat Time (in milliseconds) */
#if IDENTITY_OBJECT
  uint32 vendorId;       /* Object 0x1018 : 1 Vendor Id. */
  uint32 productCode;    /* Object 0x1018 : 2 Product code. */
  uint32 revisionNumber; /* Object 0x1018 : 3 Revison number. */
  uint32 serialNumber;   /* Object 0x1018 : 4 serial number. */
#endif
  uint32 verCfgDate; /* Object 0x1020 : 1 Configuration date, DS301 p.11-3. */
  uint32 verCfgTime; /* Object 0x1020 : 2 Configuration date, DS301 p.11-3. */
#if EMERGENCY_MASTER || EMERGENCY_CONSUMER_OBJECT
  EmcyNode emcyNodes[MAX_EMCY_GUARDED_NODES]; /* 0x1028 - Emergency Consumer Object. List of guarded EMCY COB-IDs */
#endif
#if ERROR_BEHAVIOR 
  uint8 CommunicationError; /* Object 0x1029 : 1 Communication error, DS301, p125 */
#endif
  coSDO SDO[SDO_MAX_COUNT]; /* 0x1200 - 0x1300 - SDO Server and Client Parameters */
  coPDO PDO[PDO_MAX_COUNT]; /* 0x1400 - 0x15FF and 0x1800 - 0x19FF - RPDO/TPDO Communication Parameters */
#if DYNAMIC_PDO_MAPPING
  coPdoMapItem dynPdoMap[DYNAMIC_PDO_MAPPING_MAP_ITEMS]; /* 0x1600 - 0x17FF and 0x1A00 - 0x1BFF - RPDO/TPDO mapping parameters. PDO_MAP points here when using DYNAMIC_PDO_MAPPING */
#endif
  uint32              appSwDate;  /* Object 0x1f52 : 1 Appl software date */
  uint32              appSwTime;  /* Object 0x1f52 : 2 Appl software time */
  uint32              NMTStartup;  /* Object 0x1f80: on p.15, DS302. (CO_OBJDICT_NMT_STARTUP)*/
#if BOOTUP_DS302
  coNMTNetworkList    netWorkList[BOOTUP_MAX_COUNT]; /* Object 0x1f81-0x1f88  p.16 -> */
#endif
  uint32              NMTBootTime;  /* Object 0x1f89: on p.16 Boot time, default is 0. */
#if MULTIPLEXED_PDO
  /*   Implementation of multiplexed PDO, appendix A, DS301. */
  coDispListObjT dispList[MAX_DISP_LIST_ENTRIES];
  coScannerListObjT scanList[MAX_NUMBER_OF_SCAN_LISTS];
#endif
} CoComObjects;

/* This structure stores LSS data */
typedef struct {
	uint8 nodeId;
	CanBitRate bitRate;
} CoLssData;

